Tekla Open API Reference for Tekla Structures 2025
AttributeTypeNameEditor Class
 The AttributeTypeNameEditor class provides a user interface for selecting a type for the bound attribute.
Inheritance Hierarchy
System.Object
 System.Drawing.Design.UITypeEditor
 Tekla.Structures.Dialog.AttributeTypeNameEditor
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class AttributeTypeNameEditor : UITypeEditor
Public Class AttributeTypeNameEditor
	Inherits UITypeEditor
The AttributeTypeNameEditor type exposes the following members.
Constructors
Name | Description
AttributeTypeNameEditor
Initializes a new instance of the AttributeTypeNameEditor class
Top
Methods
Name | Description
EditValue
 Edits the specified object's value using the editor style indicated by the GetEditStyle method.
 (Overrides UITypeEditor.EditValue(ITypeDescriptorContext, IServiceProvider, Object).)
GetEditStyle
 Gets the editor style used by the EditValue method.
 (Overrides UITypeEditor.GetEditStyle(ITypeDescriptorContext).)
Top
See Also
Reference
Tekla.Structures.Dialog Namespace